{
  "welcome": "Добро пожаловать в InclusiveTRIP",
  "search": "Поиск",
  "home": "Главная",
  "maplink": "Карта",
  "user": "Пользователь",
  "logout": "Выйти",
  "login": "Войти",

  "why_we_developed": "Почему мы разработали это приложение",

  "ratings": "Оценки",
  "users": "Пользователи",
  "barrier_filter": "Фильтр барьеров",
  "barrier_filter_description": "Найдите идеальное место для поездки, отфильтровав по вашим индивидуальным потребностям.",
  "radius_search": "Поиск по радиусу",
  "radius_search_description": "В какой город вы хотите отправиться?",
  "location_filter": "Фильтр местоположения",
  "location_filter_description": "Найдите идеальное место для поездки, отфильтровав по вашим индивидуальным потребностям.",
  "inclusive_trip_description": "InclusiveTRIP — это платформа, которая помогает людям с разными потребностями находить доступные места.",
  "inclusive-trip-description_home_1": "InclusiveTRIP помогает вам оценивать общественные места, такие как рестораны, кинотеатры, музеи и многое другое, с точки зрения их доступности или других критериев, а также находить подходящие места. Наше приложение позволяет вам открывать и оценивать места, чтобы помочь другим людям с похожими потребностями находить лучшие места для их следующего путешествия.",
  "inclusive-trip-description_home_2": "Независимо от того, пользуетесь ли вы инвалидной коляской, имеете ли слуховые или зрительные нарушения, путешествуете с детской коляской или домашним питомцем – InclusiveTRIP поможет убедиться, что окружающая среда доступна и инклюзивна. Ваши оценки и опыт помогают создавать сообщество, которое придает приоритет доступности. Исследуйте, оценивайте и делитесь своим опытом с InclusiveTRIP!",
  "introduce_blog_entries": "Узнайте здесь о текущих темах, связанных с инклюзией.",
  "current_topics": "Текущие темы",

  "about_us": "О нас",
  "about_us_1": "Добро пожаловать на наш сайт! Мы - небольшая, но увлеченная группа разработчиков - Себастьян, Аднан, Ахмед и Джулия - которые объединились во время буткемпа WBS Coding School, чтобы разработать приложение, которое действительно делает мир лучше.",
  "our_vision": "Наше видение",
  "about_us_2": "Наш путь начался с простой, но мощной идеи: как мы можем облегчить жизнь людям с барьерами? Для всех нас было очевидно с самого начала, что мы хотим создать что-то, что окажет положительное влияние на повседневную жизнь многих людей. Мы задавались вопросом, можем ли мы сделать мир немного более доступным.",
  "our_mission": "Наша миссия",
  "about_us_3": "Наша миссия - помогать людям с разными барьерами, будь то физическая инвалидность, нарушение зрения, слуха или использование инвалидной коляски, ориентироваться в их окружении и обеспечивать, чтобы посещаемые ими места соответствовали их потребностям. Наше приложение позволяет пользователям оценивать такие места, как рестораны, кинотеатры, больницы, парковки и многое другое, создавая сообщество, поддерживающее друг друга.",
  "about_us_4": "Почему мы разработали это приложение",
  "about_us_5": "Идея нашего приложения возникла из глубокой потребности быть частью более инклюзивного общества. Каждый из нас встречал в своей жизни людей, которые ежедневно сталкиваются с барьерами, часто незаметными для других. Эти впечатления мотивировали нас создать что-то, что способствует не только физической, но и социальной доступности.",
  "about_us_6": "Мы хотели создать платформу, которая не только оценивает, но и показывает, как легко можно преодолеть барьеры, если у вас есть правильная информация. Это наш вклад в предоставление людям с особыми потребностями больше свободы и независимости.",
  "our_team": "Наша команда",
  "sebastian": "Себастьян",
  "adnan": "Аднан",
  "ahmed": "Ахмед",
  "julia": "Джулия",
  "about_us_7": "Мы, команда, стоящая за приложением, гордимся тем, что мы достигли за короткое время. У каждого из нас есть своя мотивация и история, которые привели нас к этому проекту:",
  "about_us_8": "Вместе мы не только разработали приложение, но и воплотили в жизнь видение, которым хотим поделиться с миром. Мы надеемся, что наше приложение станет инструментом, который разрушает барьеры и строит мосты – для более инклюзивного общества.",
  "about_us_9": "Спасибо, что стали частью этого пути и помогаете нам сделать мир немного лучше.",

  "impressum": {
    "title": "Выходные данные",
    "section1": {
      "title": "Информация в соответствии с § 5 TMG:",
      "content": "Германия"
    },
    "section2": {
      "title": "Представители:",
      "content": "Себастьян Ольтофф <a href=\"mailto:sebastian-olthoff@gmx.de\" className=\"text-blue-500 hover:underline\">sebastian-olthoff@gmx.de</a><br />Аднан Абдальрахман <a href=\"mailto:adnan.24150@gmail.com\" className=\"text-blue-500 hover:underline\">adnan.24150@gmail.com</a><br />Ахмед Мохамад <a href=\"mailto:rashin2604@gmail.com\" className=\"text-blue-500 hover:underline\">rashin2604@gmail.com</a><br />Джулия Лев <a href=\"mailto:julia.loew@gmx.net\" className=\"text-blue-500 hover:underline\">julia.loew@gmx.net</a>"
    },
    "section3": {
      "title": "Ответственный за содержание согласно § 55 Abs. 2 RStV:",
      "content": "Себастьян Ольтофф<br />Аднан Абдальрахман<br />Ахмед Мохамад<br />Джулия Лев"
    },
    "section4": {
      "title": "Отказ от ответственности:",
      "content1": {
        "title": "Ответственность за содержание:",
        "content": "Как поставщик услуг, мы несем ответственность за собственное содержание на этих страницах в соответствии с общими законами, согласно § 7 Abs.1 TMG. В соответствии с §§ 8–10 TMG, мы не обязаны как поставщики услуг контролировать переданную или сохраненную внешнюю информацию или расследовать обстоятельства, указывающие на незаконную деятельность."
      },
      "content2": "Обязательства по удалению или блокированию использования информации в соответствии с общими законами остаются в силе. Однако ответственность в этом отношении возможна только с момента знания о конкретном нарушении. Если мы узнаем о таких нарушениях, мы немедленно удалим это содержимое.",
      "content3": {
        "title": "Ответственность за ссылки:",
        "content": "Наше предложение содержит ссылки на внешние веб-сайты третьих лиц, на содержание которых мы не можем повлиять. Поэтому мы не несем никакой ответственности за этот внешний контент. Ответственность за содержание связанных страниц всегда несет соответствующий поставщик или оператор страниц. Связанные страницы были проверены на предмет возможных нарушений законодательства на момент ссылки. Незаконное содержание на момент ссылки не было распознано."
      },
      "content4": "Однако постоянный контроль за содержанием связанных страниц без конкретных указаний на нарушение нецелесообразен. Если мы узнаем о каких-либо нарушениях, мы немедленно удалим такие ссылки.",
      "content5": {
        "title": "Авторское право:",
        "content": "Содержание и работы на этих страницах, созданные операторами сайта, охраняются законодательством Германии об авторском праве. Дублирование, обработка, распространение и любое использование вне пределов авторского права требуют письменного согласия соответствующего автора или создателя. Загрузки и копии этого сайта разрешены только для частного, некоммерческого использования."
      },
      "content6": "Насколько контент на этом сайте не был создан оператором, авторские права третьих лиц соблюдаются. В частности, контент третьих лиц отмечен как таковой. Если вы все же узнаете о нарушении авторских прав, пожалуйста, сообщите нам об этом. Если мы узнаем о каких-либо нарушениях, мы немедленно удалим это содержимое.",
      "content7": {
        "title": "Разрешение споров:",
        "content": "Европейская комиссия предоставляет платформу для разрешения онлайн-споров. Наш адрес электронной почты вы можете найти выше в выходных данных."
      },
      "content8": "Мы не обязаны и не намерены участвовать в процедурах разрешения споров перед арбитражным судом для потребителей."
    }
  },

  "footer": {
    "copyright": "Авторские права © {{year}} - Все права защищены",
    "impressum": "Выходные данные",
    "datenschutz": "Политика конфиденциальности",
    "ueberuns": "О нас"
  },

  "createRating": {
    "title": "Написать отзыв",
    "subtitle": "Оцените {{place}} на основе вашего опыта.",
    "barrierSuitable": "Подходит для {{barrierName}}",
    "commentLabel": "Поделитесь вашим опытом",
    "commentPlaceholder": "Отчет о впечатлениях",
    "whatToWrite": "Что написать?",
    "modalTitle": "Что бы вы хотели оценить?",
    "modalSubtitle": "Я хочу оценить доступность для:",
    "modalCancel": "Отмена",
    "modalOk": "ОК",
    "addImagesTitle": "Добавьте фотографии к вашему отзыву!",
    "dropzoneText": "Перетащите изображения сюда или щелкните, чтобы выбрать изображения",
    "submitButton": "Отправить отзыв",
    "errorMessage": {
      "emptyComment": "Поле отчета о впечатлениях не может быть пустым.",
      "maxFiles": "Вы можете загрузить максимум 5 изображений",
      "uploadError": "Ошибка загрузки файлов, пожалуйста, попробуйте еще раз"
    },
    "successMessage": "Спасибо, ваш отзыв был добавлен!"
  },

  "barriers": {
    "barrier1": "Пользователи инвалидных колясок",
    "barrier2": "Дети",
    "barrier3": "Слепые люди",
    "barrier4": "Глухие люди",
    "barrier5": "Люди, не являющиеся носителями языка",
    "barrier6": "Люди с тревожностью",
    "barrier7": "Люди с когнитивными нарушениями",
    "barrier8": "Люди с клаустрофобией",
    "barrier9": "Владельцы домашних животных"
  },

  "common": {
    "bewerten": "оценить"
  },

  "usersection": {
    "profile_of": "Профиль",
    "change_user_data": "Измените данные пользователя и отредактируйте свои отзывы.",
    "your_ratings": "Ваши отзывы",
    "you_rated": "Вы оценили",
    "read_more": "читать дальше"
  },

  "userProfileForm": {
    "personal_data": "Персональные данные",
    "first_name": "Имя",
    "last_name": "Фамилия",
    "email": "Электронная почта",
    "save_changes": "Сохранить изменения",
    "update_success": "Данные пользователя успешно обновлены."
  },

  "map": {
    "where_to_travel": "Куда вы хотите поехать?",
    "how_search_works": "..как работает поиск",
    "icon_map": "Карта значков",
    "how_search_works_title": "Как работает поиск:",
    "step1": "Выберите город из списка или выполните поиск по определенному адресу, используя поле поиска на карте.",
    "step2": "Введите тип места, которое хотите посетить.",
    "step3": "Щелкните значок на карте, чтобы просмотреть отзывы об этом месте или оставить свой отзыв.",
    "close": "Закрыть"
  },

  "categorySelector": {
    "select_category": "Выберите категорию:"
  },

  "citySelector": {
    "select_city": "Выберите город:"
  },

  "placeMarker": {
    "ratings": "Оценки",
    "create_rating": "Оставить отзыв"
  },

  "ratingspage": {
    "no_reviews": "Отзывов об этом месте пока нет. Напишите отзыв и поделитесь своими впечатлениями!",
    "add_review": "Добавить отзыв",
    "back": "Назад",
    "reviews": "Отзывы",
    "average_rating_for": "Средняя оценка для",
    "review_by": "Отзыв от",
    "on": "на",
    "read_more": "Читать дальше"
  },

  "detailReview": {
    "review_of": "Отзыв от",
    "on": "на",
    "reviewed_by": "Вот как {{placeName}} был оценен {{userName}}:",
    "suitable_for": "Подходит для",
    "icon_map": "Карта значков",
    "error_loading_reviews": "Ошибка загрузки отзывов.",
    "back": "Назад"
  },

  "reviewEdit": {
    "had": "имел",
    "on": "на",
    "rated": "оценено",
    "learn_more": "Узнать больше об этом отзыве.",
    "suitable_for": "Подходит для",
    "icon_map": "Карта значков",
    "error_loading_reviews": "Ошибка загрузки отзывов.",
    "update_success": "Отзыв успешно обновлен.",
    "error_updating_review": "Ошибка обновления отзыва.",
    "delete_success": "Отзыв успешно удален.",
    "error_deleting_review": "Ошибка удаления отзыва.",
    "update": "Обновить",
    "delete": "Удалить",
    "back": "Назад",
    "confirm_delete": "Действительно удалить отзыв?",
    "cancel": "Отмена",
    "comment_placeholder": "Введите описание здесь"
  },

  "dataprotection": {
    "title": "Защита данных",
    "section1": {
      "title": "1. Защита данных вкратце",
      "content": "Мы рады вашему интересу к нашему веб-сайту. Защита ваших личных данных особенно важна для нас. Мы относимся к вашим персональным данным конфиденциально и в соответствии с законодательными положениями о защите данных и настоящей декларацией о защите данных."
    },
    "section2": {
      "title": "2. Ответственное лицо",
      "content": "Ответственным за обработку данных на этом сайте является:"
    },
    "section3": {
      "title": "3. Сбор и хранение личных данных, их тип и цель использования",
      "subtitle1": "a) При посещении сайта",
      "content1": "Когда вы заходите на наш веб-сайт, информация автоматически отправляется на сервер нашего веб-сайта браузером, используемым на вашем устройстве. Эта информация временно хранится в так называемом журнале. Следующая информация собирается без вашего вмешательства и хранится до автоматического удаления:",
      "list1": [
        "IP-адрес запрашивающего компьютера,",
        "Дата и время доступа,",
        "Имя и URL запрашиваемого файла,",
        "Веб-сайт, с которого осуществляется доступ (URL-источник),",
        "Используемый браузер и, при необходимости, операционная система вашего компьютера, а также имя вашего интернет-провайдера."
      ],
      "content2": "Указанные данные обрабатываются нами для следующих целей:",
      "list2": [
        "Обеспечение бесперебойного подключения к веб-сайту,",
        "Обеспечение удобного использования нашего веб-сайта,",
        "Оценка безопасности и стабильности системы, а также",
        "для дальнейших административных целей."
      ],
      "content3": "Правовая основа для обработки данных - ст. 6 параграф 1 предложение 1 лит. f DSGVO. Наш законный интерес проистекает из вышеперечисленных целей для сбора данных. Мы ни в коем случае не используем собранные данные для целей, связанных с личной идентификацией."
    },
    "section4": {
      "title": "4. Передача данных",
      "content": "Ваши личные данные не будут переданы третьим лицам, если вы не дали на это явное согласие или это не требуется по закону."
    },
    "section5": {
      "title": "5. Права субъектов данных",
      "content": "У вас есть право:",
      "list": [
        "Запросить информацию о ваших личных данных, обработанных нами в соответствии со ст. 15 DSGVO,",
        "Запросить исправление неверных или неполных личных данных, хранимых у нас в соответствии со ст. 16 DSGVO,",
        "Запросить удаление ваших личных данных, хранимых у нас в соответствии со ст. 17 DSGVO,",
        "Запросить ограничение обработки ваших личных данных в соответствии со ст. 18 DSGVO,",
        "Получить ваши личные данные, которые вы нам предоставили, в структурированном, общеупотребительном и машиночитаемом формате или запросить передачу другому ответственному лицу в соответствии со ст. 20 DSGVO,",
        "Отозвать ваше согласие, данное нам в любое время, в соответствии со ст. 7 параграф 3 DSGVO,",
        "Подать жалобу в надзорный орган в соответствии со ст. 77 DSGVO."
      ]
    },
    "section6": {
      "title": "6. Право на возражение",
      "content": "Если ваши личные данные обрабатываются на основании законных интересов в соответствии со ст. 6 параграф 1 предложение 1 лит. f DSGVO, у вас есть право возражать против обработки ваших личных данных в соответствии со ст. 21 DSGVO."
    },
    "section7": {
      "title": "7. Безопасность данных",
      "content": "Мы используем процедуру SSL (Secure Socket Layer) в рамках посещения сайта в сочетании с наивысшим уровнем шифрования, поддерживаемым вашим браузером."
    },
    "section8": {
      "title": "8. Действительность и изменения этой политики конфиденциальности",
      "content": "Настоящая политика конфиденциальности действительна в настоящее время и имеет статус [дата]. В связи с дальнейшим развитием нашего веб-сайта или изменением правовых или нормативных требований может возникнуть необходимость изменить настоящую политику конфиденциальности."
    }
  },

  "loginpage": {
    "title": "Вход",
    "subtitle": "Пожалуйста, войдите, чтобы продолжить.",
    "icon_alt": "Иконка входа",
    "email_placeholder": "Адрес электронной почты",
    "password_placeholder": "Пароль",
    "login_button": "Войти",
    "forgot_password": "Забыли пароль?",
    "no_account": "Еще нет аккаунта?",
    "all_fields_required": "Все поля обязательны для заполнения.",
    "password_reset_email_sent": "Отправлено письмо для сброса пароля. Пожалуйста, проверьте свою почту.",
    "reset_password_button": "Сбросить пароль"
  },

  "forgotPasswordHandler": {
    "error_sending_email": "Ошибка при отправке письма для сброса пароля. Пожалуйста, попробуйте еще раз."
  },

  "registerpage": {
    "password_match_toast": "Пароли не совпадают!",
    "password_length_toast": "Пароль должен содержать не менее 8 символов!",
    "register_success_toast": "Регистрация успешна! Добро пожаловать!",
    "register_error_toast": "При регистрации произошла ошибка. Пожалуйста, попробуйте позже.",
    "all_fields_required": "Пожалуйста, заполните все поля для регистрации.",
    "headline": "Регистрация",
    "description": "Создайте профиль, чтобы оставлять отзывы",
    "emailPlaceholder": "Адрес электронной почты",
    "firstNamePlaceholder": "Имя",
    "lastNamePlaceholder": "Фамилия",
    "passwordPlaceholder": "Пароль",
    "confirmPasswordPlaceholder": "Подтвердите пароль",
    "submitButton": "Зарегистрироваться"
  },
  "FilterableSelect": {
    "select": "Выбрать"
  }
}
