{
  "welcome": "InclusiveTRIP में आपका स्वागत है",
  "search": "खोजें",
  "home": "होम",
  "maplink": "मानचित्र",
  "user": "उपयोगकर्ता",
  "logout": "लॉगआउट",
  "login": "लॉगिन",

  "why_we_developed": "हमने इस ऐप को क्यों विकसित किया",

  "ratings": "रेटिंग्स",
  "users": "उपयोगकर्ता",
  "barrier_filter": "बाधा फ़िल्टर",
  "barrier_filter_description": "अपनी व्यक्तिगत आवश्यकताओं के अनुसार फ़िल्टर करके अपनी यात्रा के लिए आदर्श स्थान खोजें।",
  "radius_search": "त्रिज्या खोज",
  "radius_search_description": "आप किस शहर की यात्रा करना चाहेंगे?",
  "location_filter": "स्थान फ़िल्टर",
  "location_filter_description": "अपनी व्यक्तिगत आवश्यकताओं के अनुसार फ़िल्टर करके अपनी यात्रा के लिए आदर्श स्थान खोजें।",
  "inclusive_trip_description": "InclusiveTRIP एक ऐसा मंच है जो विभिन्न आवश्यकताओं वाले लोगों को सुलभ स्थान खोजने में सक्षम बनाता है।",
  "inclusive-trip-description_home_1": "InclusiveTRIP आपको रेस्तरां, सिनेमा, संग्रहालय आदि जैसे सार्वजनिक स्थानों की पहुंच या अन्य मानदंडों के अनुसार मूल्यांकन करने और उपयुक्त स्थान खोजने में मदद करता है। हमारा ऐप आपको स्थानों की खोज और मूल्यांकन करने की अनुमति देता है ताकि अन्य समान आवश्यकताओं वाले लोगों को उनके अगले शहर के दौरे के लिए सर्वोत्तम स्थान मिल सके।",
  "inclusive-trip-description_home_2": "चाहे आप व्हीलचेयर का उपयोग करते हों, बधिर हों, दृष्टिबाधित हों, स्ट्रॉलर के साथ यात्रा कर रहे हों या अपने साथ एक पालतू पशु हो – InclusiveTRIP यह सुनिश्चित करने के लिए एक उपकरण है कि आपके आस-पास का वातावरण सुलभ और समावेशी हो। आपकी रेटिंग्स और अनुभव एक ऐसी समुदाय का निर्माण करने में सहायक होते हैं जो सुलभता को प्राथमिकता देती है। InclusiveTRIP के साथ अपने अनुभवों की खोज करें, उन्हें रेट करें और साझा करें!",
  "introduce_blog_entries": "यहाँ समावेशन से संबंधित मौजूदा विषयों पर जानकारी प्राप्त करें।",
  "current_topics": "वर्तमान विषय",

  "about_us": "हमारे बारे में",
  "about_us_1": "हमारी वेबसाइट पर आपका स्वागत है! हम एक छोटे लेकिन जोशीले डेवलपर्स का समूह हैं - Sebastian, Adnan, Ahmed, और Julia - जो WBS कोडिंग स्कूल के बूटकैम्प के दौरान एक ऐप विकसित करने के लिए एक साथ आए हैं जो वास्तव में अंतर लाता है।",
  "our_vision": "हमारी दृष्टि",
  "about_us_2": "हमारी यात्रा एक सरल लेकिन शक्तिशाली विचार से शुरू हुई: हम बाधा वाले लोगों के लिए जीवन को कैसे आसान बना सकते हैं? हमारे लिए यह शुरू से ही स्पष्ट था कि हम ऐसा कुछ बनाना चाहते हैं जिसका कई लोगों के दैनिक जीवन पर सकारात्मक प्रभाव पड़े। हमने सोचा कि अगर हम दुनिया को थोड़ा अधिक सुलभ बनाने का एक तरीका खोज सकते हैं।",
  "our_mission": "हमारा मिशन",
  "about_us_3": "हमारा मिशन उन लोगों की मदद करना है जो विभिन्न बाधाओं का सामना कर रहे हैं - चाहे वह दृष्टिबाधिता हो, बधिरता हो, या व्हीलचेयर का उपयोग हो - ताकि वे अपने आस-पास के स्थानों को बेहतर ढंग से नेविगेट कर सकें और यह सुनिश्चित कर सकें कि उनके द्वारा देखे जाने वाले स्थान उनकी आवश्यकताओं के अनुसार हों। हमारी ऐप उपयोगकर्ताओं को रेस्तरां, सिनेमा, अस्पतालों, पार्किंग स्थानों और बहुत कुछ के स्थानों का मूल्यांकन करने की अनुमति देती है, जिससे एक ऐसा समुदाय बनता है जो एक-दूसरे का समर्थन करता है।",
  "about_us_4": "हमने इस ऐप को क्यों विकसित किया",
  "about_us_5": "हमारे ऐप का विचार एक समावेशी समाज का हिस्सा बनने की गहरी इच्छा से आया था। हम में से प्रत्येक ने अपने जीवन में उन लोगों का सामना किया है जो रोजाना ऐसी बाधाओं का सामना करते हैं जो अक्सर दूसरों के लिए अदृश्य रहती हैं। इन अनुभवों ने हमें कुछ ऐसा बनाने के लिए प्रेरित किया जो न केवल भौतिक बल्कि सामाजिक सुलभता को भी बढ़ावा दे।",
  "about_us_6": "हम एक ऐसा मंच बनाना चाहते थे जो केवल मूल्यांकन ही नहीं करता बल्कि यह भी दिखाता है कि सही जानकारी के साथ बाधाओं को कैसे आसानी से पार किया जा सकता है। यह ऐप विशेष जरूरतों वाले लोगों को अधिक स्वतंत्रता और स्वतंत्रता देने में हमारा योगदान है।",
  "our_team": "हमारी टीम",
  "sebastian": "Sebastian",
  "adnan": "Adnan",
  "ahmed": "Ahmed",
  "julia": "Julia",
  "about_us_7": "हम, ऐप के पीछे की टीम, उस पर गर्व करते हैं जो हमने कम समय में हासिल किया है। हम में से प्रत्येक की अपनी प्रेरणा और कहानी है जिसने हमें इस प्रोजेक्ट तक पहुँचाया:",
  "about_us_8": "हमने न केवल एक ऐप विकसित किया है बल्कि एक दृष्टि को साकार किया है जिसे हम दुनिया के साथ साझा करना चाहते हैं। हमें आशा है कि हमारा ऐप एक ऐसा उपकरण बनेगा जो बाधाओं को तोड़े और समाज को और अधिक समावेशी बनाए।",
  "about_us_9": "इस यात्रा का हिस्सा बनने और हमें दुनिया को थोड़ा बेहतर बनाने में मदद करने के लिए धन्यवाद।",

  "impressum": {
    "title": "छाप",
    "section1": {
      "title": "§ 5 TMG के अनुसार जानकारी:",
      "content": "जर्मनी"
    },
    "section2": {
      "title": "द्वारा प्रतिनिधित्व:",
      "content": "Sebastian Olthoff <a href=\"mailto:sebastian-olthoff@gmx.de\" className=\"text-blue-500 hover:underline\">sebastian-olthoff@gmx.de</a><br />Adnan Abdalrahmen <a href=\"mailto:adnan.24150@gmail.com\" className=\"text-blue-500 hover:underline\">adnan.24150@gmail.com</a><br />Ahmed Mohamad <a href=\"mailto:rashin2604@gmail.com\" className=\"text-blue-500 hover:underline\">rashin2604@gmail.com</a><br />Julia Löw <a href=\"mailto:julia.loew@gmx.net\" className=\"text-blue-500 hover:underline\">julia.loew@gmx.net</a>"
    },
    "section3": {
      "title": "§ 55 Abs. 2 RStV के अनुसार सामग्री के लिए जिम्मेदार:",
      "content": "Sebastian Olthoff<br />Adnan Abdalrahmen<br />Ahmed Mohamad<br />Julia Löw"
    },
    "section4": {
      "title": "अस्वीकरण:",
      "content1": {
        "title": "सामग्री की जिम्मेदारी:",
        "content": "सेवा प्रदाता के रूप में, हम इन पृष्ठों पर हमारी अपनी सामग्री के लिए सामान्य कानूनों के अनुसार जिम्मेदार हैं। §§ 8 से 10 TMG के अनुसार, हम सेवा प्रदाता के रूप में प्रसारित या संग्रहीत बाहरी जानकारी की निगरानी करने के लिए बाध्य नहीं हैं और न ही अवैध गतिविधि का संकेत देने वाली परिस्थितियों की जांच करने के लिए बाध्य हैं।"
      },
      "content2": "जानकारी के उपयोग को हटाने या अवरोधित करने के लिए सामान्य कानूनों के अनुसार दायित्व इससे अप्रभावित रहते हैं। हालांकि, इस संबंध में दायित्व का पालन केवल एक विशिष्ट उल्लंघन की जानकारी के समय से ही किया जा सकता है। यदि हमें इस तरह के उल्लंघनों के बारे में पता चलता है, तो हम इस सामग्री को तुरंत हटा देंगे।",
      "content3": {
        "title": "लिंक के लिए जिम्मेदारी:",
        "content": "हमारे प्रस्ताव में तीसरे पक्ष की बाहरी वेबसाइटों के लिंक शामिल हैं, जिनकी सामग्री पर हमारा कोई नियंत्रण नहीं है। इसलिए, हम इन बाहरी सामग्रियों के लिए कोई जिम्मेदारी नहीं ले सकते। लिंक किए गए पृष्ठों की सामग्री के लिए संबंधित प्रदाता या ऑपरेटर हमेशा जिम्मेदार होता है। लिंक किए गए पृष्ठों को लिंक के समय कानूनी उल्लंघनों के लिए जांचा गया था। लिंक के समय कोई अवैध सामग्री पहचानने योग्य नहीं थी।"
      },
      "content4": "हालांकि, बिना उल्लंघन के संकेतों के लिंक किए गए पृष्ठों की सामग्री की स्थायी निगरानी उचित नहीं है। यदि हमें किसी कानूनी उल्लंघन के बारे में जानकारी मिलती है, तो हम तुरंत इस तरह के लिंक हटा देंगे।",
      "content5": {
        "title": "कॉपीराइट:",
        "content": "इन पृष्ठों पर साइट संचालकों द्वारा बनाई गई सामग्री और कार्य जर्मन कॉपीराइट कानून के अधीन हैं। कॉपीराइट कानून की सीमा के बाहर प्रतिलिपि, प्रसंस्करण, वितरण और किसी भी प्रकार के शोषण के लिए संबंधित लेखक या निर्माता की लिखित सहमति की आवश्यकता होती है। इस साइट की डाउनलोड और प्रतियां केवल निजी, गैर-व्यावसायिक उपयोग के लिए अनुमत हैं।"
      },
      "content6": "जहां तक इस साइट पर सामग्री को संचालक द्वारा नहीं बनाया गया था, वहां तृतीय पक्षों के कॉपीराइट का सम्मान किया गया है। विशेष रूप से तृतीय पक्ष की सामग्री को ऐसे चिह्नित किया गया है। फिर भी यदि आपको कॉपीराइट उल्लंघन के बारे में जानकारी मिलती है, तो कृपया हमें सूचित करें। यदि हमें किसी उल्लंघन के बारे में जानकारी मिलती है, तो हम तुरंत इस तरह की सामग्री को हटा देंगे।",
      "content7": {
        "title": "विवाद समाधान:",
        "content": "यूरोपीय आयोग ऑनलाइन विवाद समाधान के लिए एक मंच प्रदान करता है। आप उपर्युक्त छाप में हमारा ईमेल पता पा सकते हैं।"
      },
      "content8": "हम किसी उपभोक्ता मध्यस्थता बोर्ड के सामने विवाद समाधान कार्यवाही में भाग लेने के लिए इच्छुक या बाध्य नहीं हैं।"
    }
  },

  "footer": {
    "copyright": "कॉपीराइट © {{year}} - सभी अधिकार सुरक्षित",
    "impressum": "छाप",
    "datenschutz": "गोपनीयता नीति",
    "ueberuns": "हमारे बारे में"
  },

  "createRating": {
    "title": "समीक्षा लिखें",
    "subtitle": "अपने अनुभवों के साथ {{place}} का मूल्यांकन करें।",
    "barrierSuitable": "{{barrierName}} के लिए उपयुक्त",
    "commentLabel": "अपने अनुभव साझा करें",
    "commentPlaceholder": "अनुभव रिपोर्ट",
    "whatToWrite": "मुझे क्या लिखना चाहिए?",
    "modalTitle": "आप क्या मूल्यांकन करना चाहेंगे?",
    "modalSubtitle": "मैं निम्न के लिए पहुँच का मूल्यांकन करना चाहता हूँ:",
    "modalCancel": "रद्द करें",
    "modalOk": "ओके",
    "addImagesTitle": "अपनी समीक्षा में चित्र जोड़ें!",
    "dropzoneText": "यहाँ चित्र खींचें या चित्र चुनने के लिए क्लिक करें",
    "submitButton": "समीक्षा सबमिट करें",
    "errorMessage": {
      "emptyComment": "अनुभव रिपोर्ट क्षेत्र खाली नहीं हो सकता।",
      "maxFiles": "आप अधिकतम 5 चित्र अपलोड कर सकते हैं",
      "uploadError": "फाइलें अपलोड करते समय त्रुटि, कृपया पुनः प्रयास करें"
    },
    "successMessage": "धन्यवाद, आपकी समीक्षा जोड़ दी गई है!"
  },

  "barriers": {
    "barrier1": "व्हीलचेयर उपयोगकर्ता",
    "barrier2": "बच्चे",
    "barrier3": "नेत्रहीन व्यक्ति",
    "barrier4": "बधिर व्यक्ति",
    "barrier5": "गैर-देशी वक्ता",
    "barrier6": "चिंता से पीड़ित लोग",
    "barrier7": "संज्ञानात्मक विकलांगता वाले लोग",
    "barrier8": "क्लॉस्ट्रोफोबिया से ग्रस्त लोग",
    "barrier9": "पालतू पशु मालिक"
  },

  "common": {
    "bewerten": "मूल्यांकन करें"
  },

  "usersection": {
    "profile_of": "का प्रोफाइल",
    "change_user_data": "अपना उपयोगकर्ता डेटा बदलें और अपनी समीक्षाओं को संपादित करें।",
    "your_ratings": "आपकी समीक्षाएँ",
    "you_rated": "आपने रेट किया",
    "read_more": "और पढ़ें"
  },

  "userProfileForm": {
    "personal_data": "व्यक्तिगत डेटा",
    "first_name": "पहला नाम",
    "last_name": "अंतिम नाम",
    "email": "ईमेल",
    "save_changes": "परिवर्तन सहेजें",
    "update_success": "उपयोगकर्ता डेटा सफलतापूर्वक अपडेट किया गया।"
  },

  "map": {
    "where_to_travel": "आप कहाँ यात्रा करना चाहते हैं?",
    "how_search_works": "..खोज कैसे काम करती है",
    "icon_map": "आइकन मानचित्र",
    "how_search_works_title": "खोज कैसे काम करती है:",
    "step1": "सूची से एक शहर चुनें या मानचित्र पर खोज बार का उपयोग करके सीधे किसी विशिष्ट पते की खोज करें।",
    "step2": "जिस प्रकार का स्थान आप जाना चाहते हैं उसे दर्ज करें।",
    "step3": "इस स्थान की समीक्षाओं को देखने या समीक्षा लिखने के लिए मानचित्र पर आइकन पर क्लिक करें।",
    "close": "बंद करें"
  },

  "categorySelector": {
    "select_category": "श्रेणी का चयन करें"
  },
  "categories": {
    "category1": "रेस्तरां",
    "category2": "क्लिनिक",
    "category3": "अस्पताल",
    "category4": "विद्यालय",
    "category5": "संग्रहालय",
    "category8": "सिनेमाघर",
    "category9": "कैफ़े",
    "category10": "पर्यटक स्थल"
  },

  "citySelector": {
    "select_city": "एक शहर चुनें:"
  },

  "placeMarker": {
    "ratings": "रेटिंग्स",
    "create_rating": "समीक्षा सबमिट करें"
  },

  "ratingspage": {
    "no_reviews": "इस स्थान के लिए अभी तक कोई समीक्षा नहीं है। एक समीक्षा लिखें और अपने अनुभव साझा करें!",
    "add_review": "समीक्षा जोड़ें",
    "back": "वापस",
    "reviews": "समीक्षाएँ",
    "average_rating_for": "के लिए औसत रेटिंग",
    "review_by": "द्वारा समीक्षा",
    "on": "पर",
    "read_more": "अधिक पढ़ें"
  },

  "detailReview": {
    "review_of": "की समीक्षा",
    "on": "पर",
    "reviewed_by": "{{userName}} द्वारा {{placeName}} का मूल्यांकन इस प्रकार है:",
    "suitable_for": "के लिए उपयुक्त",
    "icon_map": "आइकन मानचित्र",
    "error_loading_reviews": "समीक्षाएँ लोड करने में त्रुटि।",
    "back": "वापस"
  },

  "reviewEdit": {
    "had": "था",
    "on": "पर",
    "rated": "रेटेड",
    "learn_more": "इस समीक्षा के बारे में अधिक जानें।",
    "suitable_for": "के लिए उपयुक्त",
    "icon_map": "आइकन मानचित्र",
    "error_loading_reviews": "समीक्षाएँ लोड करने में त्रुटि।",
    "update_success": "समीक्षा सफलतापूर्वक अपडेट की गई।",
    "error_updating_review": "समीक्षा को अपडेट करने में त्रुटि।",
    "delete_success": "समीक्षा सफलतापूर्वक हटाई गई।",
    "error_deleting_review": "समीक्षा को हटाने में त्रुटि।",
    "update": "अपडेट करें",
    "delete": "हटाएं",
    "back": "वापस",
    "confirm_delete": "वास्तव में समीक्षा हटाएं?",
    "cancel": "रद्द करें",
    "comment_placeholder": "यहां विवरण दर्ज करें"
  },

  "dataprotection": {
    "title": "डेटा संरक्षण",
    "section1": {
      "title": "1. डेटा संरक्षण का अवलोकन",
      "content": "हमारी वेबसाइट में आपकी रुचि के लिए हम प्रसन्न हैं। आपके व्यक्तिगत डेटा की सुरक्षा हमारे लिए विशेष रूप से महत्वपूर्ण है। हम आपके व्यक्तिगत डेटा को गोपनीय रूप से और कानूनी डेटा सुरक्षा विनियमों के अनुसार और इस डेटा संरक्षण घोषणा के अनुसार रखते हैं।"
    },
    "section2": {
      "title": "2. जिम्मेदार इकाई",
      "content": "इस वेबसाइट पर डेटा प्रसंस्करण के लिए जिम्मेदार है:"
    },
    "section3": {
      "title": "3. व्यक्तिगत डेटा का संग्रह और भंडारण, साथ ही उनका प्रकार और उपयोग का उद्देश्य",
      "subtitle1": "a) वेबसाइट का दौरा करते समय",
      "content1": "जब आप हमारी वेबसाइट पर पहुंचते हैं, तो आपके डिवाइस पर इस्तेमाल किए गए ब्राउज़र द्वारा हमारी वेबसाइट के सर्वर पर स्वचालित रूप से जानकारी भेजी जाती है। यह जानकारी अस्थायी रूप से तथाकथित लॉग फाइल में संग्रहीत की जाती है। यह जानकारी आपके हस्तक्षेप के बिना एकत्र की जाती है और स्वचालित हटाने तक संग्रहीत की जाती है:",
      "list1": [
        "अनुरोध करने वाले कंप्यूटर का आईपी पता,",
        "पहुंच की तिथि और समय,",
        "प्राप्त फाइल का नाम और यूआरएल,",
        "वह वेबसाइट जहाँ से पहुंच बनाई जाती है (रेफरर यूआरएल),",
        "उपयोग किए गए ब्राउज़र और, यदि लागू हो, आपके कंप्यूटर का ऑपरेटिंग सिस्टम और आपके एक्सेस प्रदाता का नाम।"
      ],
      "content2": "उपरोक्त डेटा का उपयोग हमारे द्वारा निम्नलिखित उद्देश्यों के लिए किया जाता है:",
      "list2": [
        "वेबसाइट के सुगम कनेक्शन को सुनिश्चित करना,",
        "हमारी वेबसाइट के आरामदायक उपयोग को सुनिश्चित करना,",
        "सिस्टम की सुरक्षा और स्थिरता का मूल्यांकन, साथ ही",
        "अन्य प्रशासनिक उद्देश्यों के लिए।"
      ],
      "content3": "डेटा प्रसंस्करण के लिए कानूनी आधार आर्ट है। 6 अनुच्छेद 1 पी. 1 एलिट। f DSGVO। डेटा संग्रह के ऊपर सूचीबद्ध उद्देश्यों के लिए हमारा वैध हित इनसे जुड़ा हुआ है। किसी भी मामले में हम एकत्रित डेटा का उपयोग आपकी पहचान के निष्कर्ष निकालने के लिए नहीं करते हैं।",
      "subtitle2": "b) संपर्क",
      "content4": "यदि आप हमसे ईमेल या संपर्क फ़ॉर्म के माध्यम से संपर्क करते हैं, तो आपके द्वारा प्रदान की गई संपर्क जानकारी सहित आपकी जानकारी को अनुरोध को संसाधित करने और किसी भी अनुवर्ती प्रश्नों के लिए हमारे द्वारा संग्रहीत किया जाएगा। आपकी सहमति के बिना हम इस डेटा को साझा नहीं करेंगे।",
      "content5": "इसलिए, संपर्क फ़ॉर्म में दर्ज किए गए डेटा का प्रसंस्करण विशेष रूप से आपकी सहमति पर आधारित है (आर्टिकल 6, पैराग्राफ 1, लिट. a DSGVO)। आप किसी भी समय इस सहमति को रद्द कर सकते हैं। इसके लिए एक साधारण ईमेल संदेश पर्याप्त है। रद्द करने तक किए गए डेटा प्रसंस्करण की वैधता रद्द करने से अप्रभावित रहती है।"
    },
    "section4": {
      "title": "4. डेटा स्थानांतरण",
      "content": "आपके व्यक्तिगत डेटा को तीसरे पक्षों को स्थानांतरित नहीं किया जाएगा जब तक कि आपने इसके लिए स्पष्ट रूप से सहमति नहीं दी हो या इसके लिए कानूनी दायित्व न हो।"
    },
    "section5": {
      "title": "5. डेटा विषयों के अधिकार",
      "content": "आपका अधिकार है:",
      "list": [
        "हमारे द्वारा आपके व्यक्तिगत डेटा के बारे में जानकारी का अनुरोध करना जो हम आपके द्वारा प्रदान की गई जानकारी के अनुसार संसाधित करते हैं (आर्टिकल 15 DSGVO के अनुसार),",
        "हमारे द्वारा संग्रहीत आपके असत्य या अपूर्ण व्यक्तिगत डेटा के सुधार का अनुरोध करना (आर्टिकल 16 DSGVO के अनुसार),",
        "हमारे द्वारा संग्रहीत आपके व्यक्तिगत डेटा को हटाने का अनुरोध करना (आर्टिकल 17 DSGVO के अनुसार),",
        "आपके व्यक्तिगत डेटा के प्रसंस्करण को सीमित करने का अनुरोध करना (आर्टिकल 18 DSGVO के अनुसार),",
        "आपके द्वारा हमें प्रदान किए गए व्यक्तिगत डेटा को संरचित, सामान्य, और मशीन-पठनीय प्रारूप में प्राप्त करना या इसे किसी अन्य जिम्मेदार पक्ष को स्थानांतरित करने का अनुरोध करना (आर्टिकल 20 DSGVO के अनुसार),",
        "हमारे द्वारा दिए गए सहमति को किसी भी समय रद्द करने का अधिकार (आर्टिकल 7, पैराग्राफ 3 DSGVO के अनुसार),",
        "निगरानी प्राधिकरण के पास शिकायत करने का अधिकार (आर्टिकल 77 DSGVO के अनुसार)।"
      ]
    },
    "section6": {
      "title": "6. आपत्ति का अधिकार",
      "content": "यदि आपके व्यक्तिगत डेटा को वैध हितों के आधार पर आर्टिकल 6, पैराग्राफ 1, पंक्ति 1, लिट. f DSGVO के अनुसार संसाधित किया जाता है, तो आपके पास अपने व्यक्तिगत डेटा के प्रसंस्करण का विरोध करने का अधिकार है (आर्टिकल 21 DSGVO के अनुसार)।"
    },
    "section7": {
      "title": "7. डेटा सुरक्षा",
      "content": "हम आपके ब्राउज़र द्वारा समर्थित उच्चतम स्तर के एन्क्रिप्शन के साथ एसएसएल (सिक्योर सॉकेट लेयर) प्रक्रिया का उपयोग करते हैं।"
    },
    "section8": {
      "title": "8. गोपनीयता नीति में परिवर्तन और मुद्रा",
      "content": "यह गोपनीयता नीति वर्तमान में मान्य है और इसकी स्थिति [तिथि] है। हमारी वेबसाइट के आगे के विकास या कानूनी या नियामक आवश्यकताओं में बदलाव के कारण, इस गोपनीयता नीति को बदलने की आवश्यकता हो सकती है।"
    },

    "loginpage": {
      "title": "लॉगिन",
      "subtitle": "कृपया जारी रखने के लिए लॉगिन करें।",
      "icon_alt": "लॉगिन आइकन",
      "email_placeholder": "ईमेल पता",
      "password_placeholder": "पासवर्ड",
      "login_button": "लॉगिन",
      "forgot_password": "पासवर्ड भूल गए?",
      "no_account": "अभी तक कोई खाता नहीं है?",
      "all_fields_required": "सभी फील्ड आवश्यक हैं।",
      "password_reset_email_sent": "पासवर्ड रीसेट के लिए ईमेल भेज दिया गया है। कृपया अपना इनबॉक्स देखें।",
      "reset_password_button": "पासवर्ड रीसेट करें"
    },

    "forgotPasswordHandler": {
      "error_sending_email": "पासवर्ड रीसेट ईमेल भेजने में त्रुटि। कृपया पुनः प्रयास करें।"
    },

    "registerpage": {
      "password_match_toast": "पासवर्ड मेल नहीं खा रहे हैं!",
      "password_length_toast": "पासवर्ड कम से कम 8 वर्णों का होना चाहिए!",
      "register_success_toast": "पंजीकरण सफल! स्वागत है!",
      "register_error_toast": "पंजीकरण के दौरान एक त्रुटि हुई। कृपया बाद में पुनः प्रयास करें।",
      "all_fields_required": "कृपया पंजीकरण के लिए सभी फ़ील्ड भरें।",
      "headline": "पंजीकरण",
      "description": "समीक्षाएं सबमिट करने के लिए एक प्रोफ़ाइल बनाएं",
      "emailPlaceholder": "ईमेल पता",
      "firstNamePlaceholder": "पहला नाम",
      "lastNamePlaceholder": "अंतिम नाम",
      "passwordPlaceholder": "पासवर्ड",
      "confirmPasswordPlaceholder": "पासवर्ड की पुष्टि करें",
      "submitButton": "पंजीकरण करें"
    }
  },
  "FilterableSelect": {
    "select": "चयन करें"
  }
}
