{
  "welcome": "Ласкаво просимо до InclusiveTRIP",
  "search": "Пошук",
  "home": "Головна",
  "maplink": "Карта",
  "user": "Користувач",
  "logout": "Вийти",
  "login": "Увійти",

  "why_we_developed": "Чому ми розробили цей додаток",

  "ratings": "Оцінки",
  "users": "Користувачі",
  "barrier_filter": "Фільтр бар'єрів",
  "barrier_filter_description": "Знайдіть ідеальне місце для своєї подорожі, відфільтрувавши відповідно до ваших індивідуальних потреб.",
  "radius_search": "Пошук за радіусом",
  "radius_search_description": "До якого міста ви хотіли б подорожувати?",
  "location_filter": "Фільтр місць",
  "location_filter_description": "Знайдіть ідеальне місце для своєї подорожі, відфільтрувавши відповідно до ваших індивідуальних потреб.",
  "inclusive_trip_description": "InclusiveTRIP — це платформа, яка допомагає людям з різними потребами знаходити доступні місця.",
  "inclusive-trip-description_home_1": "InclusiveTRIP допомагає оцінювати громадські місця, такі як ресторани, кінотеатри, музеї та багато іншого з точки зору їх доступності або інших критеріїв, і знаходити відповідні місця. Наш додаток дозволяє вам відкривати та оцінювати місця, щоб допомогти іншим з подібними потребами знайти найкращі місця для своєї наступної поїздки до міста.",
  "inclusive-trip-description_home_2": "Якщо ви користуєтесь інвалідним візком, глухий, маєте вади зору, подорожуєте з коляскою або з домашньою твариною — InclusiveTRIP це інструмент для забезпечення доступності та інклюзивності навколишнього середовища. Ваші оцінки та досвід допомагають створювати спільноту, яка ставить пріоритет на доступність. Відкривайте, оцінюйте та діліться своїм досвідом разом з InclusiveTRIP!",
  "introduce_blog_entries": "Знайдіть тут інформацію про актуальні теми, пов'язані з інклюзією.",
  "current_topics": "Актуальні теми",

  "about_us": "Про нас",
  "about_us_1": "Ласкаво просимо на наш вебсайт! Ми - невелика, але пристрасна група розробників – Себастіан, Аднан, Ахмед та Джулія, які зібралися разом під час буткемпу WBS Coding School, щоб розробити додаток, який дійсно має значення.",
  "our_vision": "Наша візія",
  "about_us_2": "Наша подорож почалася з простої, але потужної думки: як ми можемо зробити життя легшим для людей з бар'єрами? Для всіх нас з самого початку було зрозуміло, що ми хочемо створити щось, що матиме позитивний вплив на повсякденне життя багатьох людей. Ми запитували себе, як можемо знайти спосіб зробити світ трохи більш доступним.",
  "our_mission": "Наша місія",
  "about_us_3": "Наша місія - допомогти людям з різними бар'єрами – незалежно від того, чи це фізична інвалідність, така як вада зору, глухота або використання інвалідного візка – орієнтуватися в навколишньому середовищі та забезпечити, щоб місця, які вони відвідують, відповідали їхнім потребам. Наш додаток дозволяє користувачам оцінювати місця, такі як ресторани, кінотеатри, лікарні, місця для паркування та багато іншого, створюючи спільноту, яка підтримує одне одного.",
  "about_us_4": "Чому ми розробили цей додаток",
  "about_us_5": "Ідея нашого додатка виникла з глибокого бажання бути частиною більш інклюзивного суспільства. Кожен з нас зустрічав у своєму житті людей, які стикаються з щоденними бар'єрами, що часто залишаються невидимими для інших. Цей досвід мотивував нас створити щось, що сприяє не тільки фізичній, але й соціальній доступності.",
  "about_us_6": "Ми хотіли створити платформу, яка не тільки оцінює, але й показує, наскільки легко подолати бар'єри, маючи відповідну інформацію. Додаток - це наш внесок у надання людям з особливими потребами більше свободи та незалежності.",
  "our_team": "Наша команда",
  "sebastian": "Себастіан",
  "adnan": "Аднан",
  "ahmed": "Ахмед",
  "julia": "Джулія",
  "about_us_7": "Ми, команда за додатком, пишаємося тим, що досягли за короткий час. Кожен з нас має власну мотивацію та історію, що привели нас до цього проєкту:",
  "about_us_8": "Разом ми не лише розробили додаток, але й втілили в життя візію, яку хочемо поділитися зі світом. Ми сподіваємося, що наш додаток стане інструментом, який зламає бар'єри та побудує мости - для більш інклюзивного суспільства.",
  "about_us_9": "Дякуємо, що є частиною цієї подорожі та допомагаєте нам робити світ трохи кращим.",

  "impressum": {
    "title": "Вихідні дані",
    "section1": {
      "title": "Інформація згідно з § 5 TMG:",
      "content": "Німеччина"
    },
    "section2": {
      "title": "Представляють:",
      "content": "Себастіан Ольтофф <a href=\"mailto:sebastian-olthoff@gmx.de\" className=\"text-blue-500 hover:underline\">sebastian-olthoff@gmx.de</a><br />Аднан Абдалрахмен <a href=\"mailto:adnan.24150@gmail.com\" className=\"text-blue-500 hover:underline\">adnan.24150@gmail.com</a><br />Ахмед Мохамад <a href=\"mailto:rashin2604@gmail.com\" className=\"text-blue-500 hover:underline\">rashin2604@gmail.com</a><br />Джулія Лев <a href=\"mailto:julia.loew@gmx.net\" className=\"text-blue-500 hover:underline\">julia.loew@gmx.net</a>"
    },
    "section3": {
      "title": "Відповідальні за контент згідно з § 55 Abs. 2 RStV:",
      "content": "Себастіан Ольтофф<br />Аднан Абдалрахмен<br />Ахмед Мохамад<br />Джулія Лев"
    },
    "section4": {
      "title": "Відмова від відповідальності:",
      "content1": {
        "title": "Відповідальність за зміст:",
        "content": "Як постачальник послуг ми несемо відповідальність за власний зміст на цих сторінках відповідно до загальних законів згідно з § 7 Abs.1 TMG. Згідно з §§ 8 до 10 TMG, ми не зобов'язані як постачальники послуг контролювати передану або збережену зовнішню інформацію або досліджувати обставини, які свідчать про незаконну діяльність."
      },
      "content2": "Зобов'язання щодо видалення або блокування використання інформації згідно із загальними законами залишаються без змін. Однак відповідальність у цьому відношенні можлива лише з моменту отримання відомостей про конкретне порушення. Якщо ми дізнаємось про такі порушення, ми негайно видалимо цей контент.",
      "content3": {
        "title": "Відповідальність за посилання:",
        "content": "Наша пропозиція містить посилання на зовнішні веб-сайти третіх осіб, за вміст яких ми не несемо відповідальності. Тому ми не можемо нести відповідальність за цей зовнішній контент. Відповідний постачальник або оператор сторінок завжди відповідає за вміст пов'язаних сторінок. Пов'язані сторінки були перевірені на можливі юридичні порушення під час створення посилання. Незаконний вміст не був виявлений на момент створення посилання."
      },
      "content4": "Однак постійний контроль вмісту пов'язаних сторінок не є розумним без конкретних ознак порушення. Якщо ми дізнаємось про будь-які порушення законодавства, ми негайно видалимо такі посилання.",
      "content5": {
        "title": "Авторське право:",
        "content": "Вміст і роботи на цих сторінках, створені операторами сайту, захищені німецьким авторським правом. Дублювання, обробка, розповсюдження та будь-який вид використання за межами обмежень авторського права вимагають письмової згоди відповідного автора або творця. Завантаження та копії цього сайту дозволяються лише для особистого, некомерційного використання."
      },
      "content6": "Якщо вміст на цьому сайті не створено оператором, поважаються авторські права третіх осіб. Вміст третіх осіб спеціально позначається як такий. Якщо ви все-таки дізналися про порушення авторських прав, будь ласка, повідомте нас про це. Якщо ми дізнаємось про будь-які порушення законодавства, ми негайно видалимо такий вміст.",
      "content7": {
        "title": "Вирішення спорів:",
        "content": "Європейська комісія надає платформу для онлайн-врегулювання спорів. Ви можете знайти нашу електронну адресу вище у вихідних даних."
      },
      "content8": "Ми не готові і не зобов'язані брати участь у процесах вирішення спорів перед споживчим арбітражем."
    }
  },

  "footer": {
    "copyright": "Авторське право © {{year}} - Усі права захищені",
    "impressum": "Вихідні дані",
    "datenschutz": "Політика конфіденційності",
    "ueberuns": "Про нас"
  },

  "createRating": {
    "title": "Написати відгук",
    "subtitle": "Оцініть {{place}} за своїм досвідом.",
    "barrierSuitable": "Підходить для {{barrierName}}",
    "commentLabel": "Поділіться своїм досвідом",
    "commentPlaceholder": "Звіт про досвід",
    "whatToWrite": "Що я повинен написати?",
    "modalTitle": "Що ви хочете оцінити?",
    "modalSubtitle": "Я хочу оцінити доступність для:",
    "modalCancel": "Скасувати",
    "modalOk": "Гаразд",
    "addImagesTitle": "Додайте зображення до свого відгуку!",
    "dropzoneText": "Перетягніть зображення сюди або натисніть, щоб вибрати зображення",
    "submitButton": "Надіслати відгук",
    "errorMessage": {
      "emptyComment": "Поле звіту про досвід не може бути порожнім.",
      "maxFiles": "Ви можете завантажити максимум 5 зображень",
      "uploadError": "Помилка завантаження файлів, спробуйте ще раз"
    },
    "successMessage": "Дякуємо, ваш відгук було додано!"
  },

  "barriers": {
    "barrier1": "Люди на інвалідних візках",
    "barrier2": "Діти",
    "barrier3": "Сліпі",
    "barrier4": "Глухі",
    "barrier5": "Не носії мови",
    "barrier6": "Люди з тривожністю",
    "barrier7": "Люди з когнітивними порушеннями",
    "barrier8": "Люди з клаустрофобією",
    "barrier9": "Власники домашніх тварин"
  },

  "common": {
    "bewerten": "оцінити"
  },

  "usersection": {
    "profile_of": "Профіль",
    "change_user_data": "Змініть свої дані користувача та редагуйте свої відгуки.",
    "your_ratings": "Ваші відгуки",
    "you_rated": "Ви оцінили",
    "read_more": "читати більше"
  },

  "userProfileForm": {
    "personal_data": "Особисті дані",
    "first_name": "Ім'я",
    "last_name": "Прізвище",
    "email": "Електронна пошта",
    "save_changes": "Зберегти зміни",
    "update_success": "Дані користувача успішно оновлено."
  },

  "map": {
    "where_to_travel": "Куди ви хочете подорожувати?",
    "how_search_works": "..як працює пошук",
    "icon_map": "Карта іконок",
    "how_search_works_title": "Як працює пошук:",
    "step1": "Виберіть місто зі списку або знайдіть конкретну адресу за допомогою поля пошуку на карті.",
    "step2": "Введіть тип місця, яке ви хочете відвідати.",
    "step3": "Натисніть на іконку на карті, щоб переглянути відгуки для цього місця або написати відгук.",
    "close": "Закрити"
  },

  "categorySelector": {
    "select_category": "Вибрати категорію"
  },
  "categories": {
    "category1": "Ресторан",
    "category2": "Клініка",
    "category3": "Лікарня",
    "category4": "Школа",
    "category5": "Музей",
    "category8": "Кінотеатри",
    "category9": "Кафе",
    "category10": "Визначні місця"
  },

  "citySelector": {
    "select_city": "Виберіть місто:"
  },

  "placeMarker": {
    "ratings": "Оцінки",
    "create_rating": "Надіслати відгук"
  },

  "ratingspage": {
    "no_reviews": "Поки що немає відгуків для цього місця. Напишіть відгук і поділіться своїм досвідом!",
    "add_review": "Додати відгук",
    "back": "Назад",
    "reviews": "Відгуки",
    "average_rating_for": "Середня оцінка для",
    "review_by": "Відгук від",
    "on": "на",
    "read_more": "Читати більше"
  },

  "detailReview": {
    "review_of": "Відгук про",
    "on": "на",
    "reviewed_by": "Це як {{placeName}} було оцінено {{userName}}:",
    "suitable_for": "Підходить для",
    "icon_map": "Карта іконок",
    "error_loading_reviews": "Помилка завантаження відгуків.",
    "back": "Назад"
  },

  "reviewEdit": {
    "had": "мав",
    "on": "на",
    "rated": "оцінено",
    "learn_more": "Дізнатися більше про цей відгук.",
    "suitable_for": "Підходить для",
    "icon_map": "Карта іконок",
    "error_loading_reviews": "Помилка завантаження відгуків.",
    "update_success": "Відгук успішно оновлено.",
    "error_updating_review": "Помилка оновлення відгуку.",
    "delete_success": "Відгук видалено успішно.",
    "error_deleting_review": "Помилка видалення відгуку.",
    "update": "Оновити",
    "delete": "Видалити",
    "back": "Назад",
    "confirm_delete": "Справді видалити відгук?",
    "cancel": "Скасувати",
    "comment_placeholder": "Введіть опис тут"
  },

  "dataprotection": {
    "title": "Захист даних",
    "section1": {
      "title": "1. Захист даних на перший погляд",
      "content": "Ми раді вашому інтересу до нашого вебсайту. Захист ваших особистих даних особливо важливий для нас. Ми ставимося до ваших особистих даних конфіденційно та відповідно до законодавчих положень про захист даних і цієї заяви про захист даних."
    },
    "section2": {
      "title": "2. Відповідальна особа",
      "content": "Відповідальним за обробку даних на цьому вебсайті є:"
    },
    "section3": {
      "title": "3. Збір і зберігання особистих даних та їх тип і мета використання",
      "subtitle1": "a) При відвідуванні вебсайту",
      "content1": "Коли ви заходите на наш вебсайт, інформація автоматично надсилається на сервер нашого вебсайту браузером, який використовується на вашому пристрої. Ця інформація тимчасово зберігається у так званому файлі журналу. Наступна інформація збирається без вашого втручання і зберігається до автоматичного видалення:",
      "list1": [
        "IP-адреса комп'ютера, з якого надійшов запит,",
        "Дата і час доступу,",
        "Ім'я та URL витребуваного файлу,",
        "Вебсайт, з якого здійснюється доступ (URL посилання),",
        "Використаний браузер і, за наявності, операційна система вашого комп'ютера, а також ім'я вашого постачальника доступу."
      ],
      "content2": "Вищезазначені дані обробляються нами для наступних цілей:",
      "list2": [
        "Забезпечення плавного підключення до вебсайту,",
        "Забезпечення комфортного використання нашого вебсайту,",
        "Оцінка безпеки і стабільності системи, а також",
        "для подальших адміністративних цілей."
      ],
      "content3": "Правовою основою для обробки даних є ст. 6 п. 1 с. 1 п. f DSGVO. Наш законний інтерес випливає з вищезазначених цілей збору даних. У жодному разі ми не використовуємо зібрані дані для того, щоб робити висновки про вашу особу.",
      "subtitle2": "b) Контакт",
      "content4": "Якщо ви зв'яжетесь з нами електронною поштою або за допомогою контактної форми, ваша інформація, включаючи надані вами контактні дані, буде збережена нами для обробки запиту та для будь-яких подальших питань. Ми не будемо ділитися цією інформацією без вашої згоди.",
      "content5": "Обробка даних, введених у контактну форму, здійснюється виключно на основі вашої згоди (ст. 6 п. 1 п. a DSGVO). Ви можете відкликати цю згоду в будь-який час. Для цього достатньо надіслати нам неформальне повідомлення електронною поштою. Законність обробки даних, що відбулася до моменту відкликання, залишається незмінною."
    },
    "section4": {
      "title": "4. Передача даних",
      "content": "Ваші особисті дані не будуть передаватися третім особам, якщо ви прямо не погодилися на це або якщо це не є законодавчою вимогою."
    },
    "section5": {
      "title": "5. Права суб'єктів даних",
      "content": "Ви маєте право:",
      "list": [
        "запитувати інформацію про ваші особисті дані, оброблені нами відповідно до ст. 15 DSGVO,",
        "запитувати виправлення неправильних або неповних особистих даних, збережених нами відповідно до ст. 16 DSGVO,",
        "запитувати видалення ваших особистих даних, збережених нами відповідно до ст. 17 DSGVO,",
        "запитувати обмеження обробки ваших особистих даних відповідно до ст. 18 DSGVO,",
        "отримати ваші особисті дані, які ви надали нам, у структурованому, загальноприйнятому та машиночитабельному форматі або запитати їх передачу іншій відповідальній особі відповідно до ст. 20 DSGVO,",
        "відкликати свою згоду, раніше надану нам, у будь-який час відповідно до ст. 7 п. 3 DSGVO,",
        "подати скаргу до наглядового органу відповідно до ст. 77 DSGVO."
      ]
    },
    "section6": {
      "title": "6. Право на заперечення",
      "content": "Якщо ваші особисті дані обробляються на основі законних інтересів відповідно до ст. 6 п. 1 с. 1 п. f DSGVO, ви маєте право заперечити проти обробки ваших особистих даних відповідно до ст. 21 DSGVO."
    },
    "section7": {
      "title": "7. Захист даних",
      "content": "Ми використовуємо протокол SSL (Secure Socket Layer) під час відвідування вебсайту у зв'язку з найвищим рівнем шифрування, який підтримується вашим браузером."
    },
    "section8": {
      "title": "8. Валюта та зміни до цієї політики конфіденційності",
      "content": "Ця політика конфіденційності є чинною та має статус [дата]. Через подальший розвиток нашого вебсайту або через змінені законодавчі або нормативні вимоги може виникнути потреба змінити цю політику конфіденційності."
    }
  },

  "loginpage": {
    "title": "Вхід",
    "subtitle": "Будь ласка, увійдіть, щоб продовжити.",
    "icon_alt": "Іконка входу",
    "email_placeholder": "Адреса електронної пошти",
    "password_placeholder": "Пароль",
    "login_button": "Увійти",
    "forgot_password": "Забули пароль?",
    "no_account": "Ще не маєте облікового запису?",
    "all_fields_required": "Усі поля обов'язкові.",
    "password_reset_email_sent": "Лист для скидання пароля був надісланий. Будь ласка, перевірте свою поштову скриньку.",
    "reset_password_button": "Скинути пароль"
  },

  "forgotPasswordHandler": {
    "error_sending_email": "Помилка під час надсилання листа для скидання пароля. Будь ласка, спробуйте ще раз."
  },

  "registerpage": {
    "password_match_toast": "Паролі не збігаються!",
    "password_length_toast": "Пароль має бути щонайменше 8 символів!",
    "register_success_toast": "Реєстрація успішна! Ласкаво просимо!",
    "register_error_toast": "Під час реєстрації сталася помилка. Будь ласка, спробуйте ще раз пізніше.",
    "all_fields_required": "Будь ласка, заповніть усі поля для реєстрації.",
    "headline": "Реєстрація",
    "description": "Створіть профіль, щоб залишити відгуки",
    "emailPlaceholder": "Адреса електронної пошти",
    "firstNamePlaceholder": "Ім'я",
    "lastNamePlaceholder": "Прізвище",
    "passwordPlaceholder": "Пароль",
    "confirmPasswordPlaceholder": "Підтвердження пароля",
    "submitButton": "Зареєструватися"
  },
  "FilterableSelect": {
    "select": "Вибрати"
  }
}
