{
  "welcome": "ยินดีต้อนรับสู่ InclusiveTRIP",
  "search": "ค้นหา",
  "home": "หน้าหลัก",
  "maplink": "แผนที่",
  "user": "ผู้ใช้",
  "logout": "ออกจากระบบ",
  "login": "เข้าสู่ระบบ",

  "why_we_developed": "ทำไมเราถึงพัฒนาแอปนี้",

  "ratings": "การให้คะแนน",
  "users": "ผู้ใช้",
  "barrier_filter": "ตัวกรองอุปสรรค",
  "barrier_filter_description": "ค้นหาสถานที่ที่เหมาะสมสำหรับการเที่ยวของคุณ โดยกรองตามความต้องการของคุณ",
  "radius_search": "ค้นหาภายในรัศมี",
  "radius_search_description": "คุณต้องการเดินทางไปเมืองใด?",
  "location_filter": "ตัวกรองสถานที่",
  "location_filter_description": "ค้นหาสถานที่ที่เหมาะสมสำหรับการเที่ยวของคุณ โดยกรองตามความต้องการของคุณ",
  "inclusive_trip_description": "InclusiveTRIP เป็นแพลตฟอร์มที่ช่วยให้คนที่มีความต้องการพิเศษสามารถค้นหาสถานที่ที่เข้าถึงได้",
  "inclusive-trip-description_home_1": "InclusiveTRIP ช่วยคุณในการประเมินสถานที่สาธารณะ เช่น ร้านอาหาร โรงภาพยนตร์ พิพิธภัณฑ์ และอื่นๆ ในแง่ของการเข้าถึงหรือเกณฑ์อื่นๆ และค้นหาสถานที่ที่เหมาะสม แอปของเราช่วยให้คุณค้นพบและให้คะแนนสถานที่เพื่อช่วยเหลือคนอื่นๆ ที่มีความต้องการคล้ายกันในการหาสถานที่ที่ดีที่สุดสำหรับการเดินทางของพวกเขา",
  "inclusive-trip-description_home_2": "ไม่ว่าคุณจะใช้รถเข็น เป็นผู้พิการทางการได้ยิน มีการมองเห็นที่จำกัด ใช้รถเข็นเด็ก หรือมีสัตว์เลี้ยง InclusiveTRIP เป็นเครื่องมือที่จะช่วยให้แน่ใจว่าสิ่งแวดล้อมของคุณเข้าถึงได้และครอบคลุม ประสบการณ์และการให้คะแนนของคุณช่วยสร้างชุมชนที่ให้ความสำคัญกับการเข้าถึงมากขึ้น ค้นพบ ให้คะแนน และแบ่งปันประสบการณ์ของคุณกับ InclusiveTRIP!",
  "introduce_blog_entries": "ค้นหาข้อมูลที่นี่เกี่ยวกับประเด็นปัจจุบันเกี่ยวกับการครอบคลุม",
  "current_topics": "ประเด็นปัจจุบัน",

  "about_us": "เกี่ยวกับเรา",
  "about_us_1": "ยินดีต้อนรับสู่เว็บไซต์ของเรา! เราคือกลุ่มนักพัฒนาที่มีความกระตือรือร้น – Sebastian, Adnan, Ahmed และ Julia – ที่มารวมตัวกันในระหว่างการเรียนที่ WBS Coding School เพื่อสร้างแอปที่มีผลกระทบอย่างแท้จริง",
  "our_vision": "วิสัยทัศน์ของเรา",
  "about_us_2": "การเดินทางของเราเริ่มต้นด้วยความคิดง่ายๆ แต่ทรงพลัง: เราจะทำให้ชีวิตของคนที่มีอุปสรรคง่ายขึ้นได้อย่างไร? สำหรับเราทุกคน ตั้งแต่ต้นมีความชัดเจนว่าเราต้องการสร้างสิ่งที่มีผลบวกอย่างมากต่อชีวิตประจำวันของผู้คน เราคิดถึงวิธีการที่จะทำให้โลกนี้สามารถเข้าถึงได้มากขึ้น",
  "our_mission": "ภารกิจของเรา",
  "about_us_3": "ภารกิจของเราคือการช่วยเหลือคนที่มีอุปสรรคต่างๆ ไม่ว่าจะเป็นการจำกัดทางร่างกาย เช่น การเห็นบกพร่อง การได้ยินบกพร่อง หรือการใช้รถเข็น เพื่อให้สามารถเข้าถึงสิ่งแวดล้อมของพวกเขาและมั่นใจได้ว่าสถานที่ที่พวกเขาไปสามารถตอบสนองความต้องการของพวกเขา แอปของเราช่วยให้ผู้ใช้สามารถให้คะแนนสถานที่ เช่น ร้านอาหาร โรงภาพยนตร์ โรงพยาบาล ที่จอดรถ และอื่นๆ เพื่อสร้างชุมชนที่ช่วยเหลือซึ่งกันและกัน",
  "about_us_4": "ทำไมเราถึงพัฒนาแอปนี้",
  "about_us_5": "ไอเดียของแอปเรามาจากความปรารถนาที่จะเป็นส่วนหนึ่งของสังคมที่มีการครอบคลุมมากขึ้น พวกเราทุกคนมีประสบการณ์เกี่ยวกับคนในชีวิตที่พบกับอุปสรรคในชีวิตประจำวัน ที่มักจะมองไม่เห็นสำหรับคนอื่นๆ ประสบการณ์เหล่านี้กระตุ้นให้เราสร้างบางสิ่งที่ส่งเสริมไม่เพียงแค่การเข้าถึงทางกายภาพ แต่ยังส่งเสริมการเข้าถึงทางสังคมด้วย",
  "about_us_6": "เราต้องการสร้างแพลตฟอร์มที่ไม่เพียงแต่ให้คะแนนเท่านั้น แต่ยังแสดงให้เห็นว่าการเอาชนะอุปสรรคจะง่ายขึ้นได้อย่างไรเมื่อคุณมีข้อมูลที่ถูกต้อง แอปนี้เป็นส่วนช่วยของเราเพื่อให้คนที่มีความต้องการพิเศษมีความเป็นอิสระมากขึ้น",
  "our_team": "ทีมงานของเรา",
  "sebastian": "เซบาสเตียน",
  "adnan": "อัดนาน",
  "ahmed": "อาเหม็ด",
  "julia": "จูเลีย",
  "about_us_7": "พวกเรา ทีมงานเบื้องหลังแอปภูมิใจในสิ่งที่เราทำได้ในเวลาอันสั้น แต่ละคนมีแรงบันดาลใจและเรื่องราวของตนเองที่พาเขามายังโปรเจคนี้:",
  "about_us_8": "พวกเราร่วมกันไม่เพียงแต่สร้างแอปแต่ยังทำให้วิสัยทัศน์ที่เรามีชีวิตชีวาและพร้อมจะแบ่งปันให้กับโลก เราหวังว่าแอปของเราจะเป็นเครื่องมือที่ช่วยลบข้อจำกัดและสร้างสะพานเพื่อให้สังคมครอบคลุมมากขึ้น",
  "about_us_9": "ขอบคุณที่เข้าร่วมการเดินทางนี้และช่วยให้โลกดีขึ้น",

  "impressum": {
    "title": "การแสดงข้อมูลทางกฎหมาย",
    "section1": {
      "title": "ข้อมูลตามมาตรา § 5 TMG:",
      "content": "เยอรมนี"
    },
    "section2": {
      "title": "ตัวแทนโดย:",
      "content": "Sebastian Olthoff <a href=\"mailto:sebastian-olthoff@gmx.de\" className=\"text-blue-500 hover:underline\">sebastian-olthoff@gmx.de</a><br />Adnan Abdalrahmen <a href=\"mailto:adnan.24150@gmail.com\" className=\"text-blue-500 hover:underline\">adnan.24150@gmail.com</a><br />Ahmed Mohamad <a href=\"mailto:rashin2604@gmail.com\" className=\"text-blue-500 hover:underline\">rashin2604@gmail.com</a><br />Julia Löw <a href=\"mailto:julia.loew@gmx.net\" className=\"text-blue-500 hover:underline\">julia.loew@gmx.net</a>"
    },
    "section3": {
      "title": "ผู้รับผิดชอบเนื้อหาตามมาตรา § 55 วรรค 2 RStV:",
      "content": "Sebastian Olthoff<br />Adnan Abdalrahmen<br />Ahmed Mohamad<br />Julia Löw"
    },
    "section4": {
      "title": "ข้อจำกัดความรับผิดชอบ:",
      "content1": {
        "title": "ความรับผิดชอบต่อเนื้อหา:",
        "content": "ในฐานะผู้ให้บริการเราเป็นผู้รับผิดชอบต่อเนื้อหาของเราบนหน้านี้ตามกฎหมายทั่วไปตามมาตรา § 7 วรรค 1 TMG อย่างไรก็ตามตามมาตรา §§ 8 ถึง 10 TMG เราไม่จำเป็นต้องตรวจสอบข้อมูลที่ส่งผ่านหรือเก็บไว้ภายนอกหรือสืบสวนสถานการณ์ที่ชี้บ่งถึงกิจกรรมที่ผิดกฎหมาย"
      },
      "content2": "ภาระหน้าที่ในการลบหรือบล็อกการใช้ข้อมูลตามกฎหมายทั่วไปยังคงไม่กระทบต่อสิ่งนี้ อย่างไรก็ตามความรับผิดในกรณีนี้จะเป็นไปได้เฉพาะเมื่อเราทราบถึงการละเมิดที่เฉพาะเจาะจงเท่านั้น หากเราทราบถึงการละเมิดที่เกี่ยวข้อง เราจะลบเนื้อหานี้ทันที",
      "content3": {
        "title": "ความรับผิดชอบต่อการเชื่อมโยง:",
        "content": "ข้อเสนอของเราประกอบด้วยลิงก์ไปยังเว็บไซต์ภายนอกของบุคคลที่สาม ซึ่งเนื้อหาเราไม่มีอิทธิพล ดังนั้นเราจึงไม่สามารถรับผิดชอบต่อเนื้อหาภายนอกนี้ได้ เจ้าของหรือผู้ดำเนินการหน้าที่เชื่อมโยงรับผิดชอบต่อเนื้อหาของลิงก์ตลอดเวลา หน้าที่เชื่อมโยงได้รับการตรวจสอบเมื่อเชื่อมโยงถึงการละเมิดกฎหมายที่เป็นไปได้ ในขณะที่เชื่อมโยงไม่พบเนื้อหาที่ผิดกฎหมาย"
      },
      "content4": "การตรวจสอบเนื้อหาของหน้าที่เชื่อมโยงอย่างถาวรนั้นไม่สามารถทำได้โดยไม่จำเป็นต้องมีการบ่งชี้ที่เป็นรูปธรรมของการละเมิด หากเราทราบถึงการละเมิดกฎหมายใด ๆ เราจะลบลิงก์ดังกล่าวทันที",
      "content5": {
        "title": "ลิขสิทธิ์:",
        "content": "เนื้อหาและผลงานที่สร้างขึ้นโดยผู้ให้บริการบนหน้านี้อยู่ภายใต้กฎหมายลิขสิทธิ์ของเยอรมัน การทำสำเนา แก้ไข แจกจ่าย และการใช้ประเภทใด ๆ นอกขอบเขตของลิขสิทธิ์จำเป็นต้องได้รับการอนุมัติเป็นลายลักษณ์อักษรจากผู้เขียนหรือผู้สร้างที่เกี่ยวข้อง การดาวน์โหลดและคัดลอกหน้านี้ได้รับอนุญาตเฉพาะเพื่อการใช้งานส่วนตัวที่ไม่ใช่เชิงพาณิชย์เท่านั้น"
      },
      "content6": "ในกรณีที่เนื้อหาบนหน้านี้ไม่ได้สร้างโดยผู้ให้บริการ จะมีการเคารพสิทธิ์ลิขสิทธิ์ของบุคคลที่สาม โดยเฉพาะเนื้อหาของบุคคลที่สามจะถูกระบุว่าเป็นเช่นนั้น หากคุณทราบถึงการละเมิดลิขสิทธิ์โปรดแจ้งให้เราทราบ หากเราทราบถึงการละเมิดกฎหมายใด ๆ เราจะลบเนื้อหานั้นทันที",
      "content7": {
        "title": "การแก้ไขข้อพิพาท:",
        "content": "คณะกรรมาธิการยุโรปให้บริการแพลตฟอร์มสำหรับการแก้ไขข้อพิพาทออนไลน์ คุณสามารถดูที่อยู่อีเมลของเราข้างต้นในหน้าการแสดงข้อมูลทางกฎหมาย"
      },
      "content8": "เราไม่เต็มใจหรือมีหน้าที่ในการเข้าร่วมกระบวนการระงับข้อพิพาทต่อหน้าศาลอนุญาโตตุลาการของผู้บริโภค"
    }
  },

  "footer": {
    "copyright": "ลิขสิทธิ์ © {{year}} - สงวนลิขสิทธิ์ทั้งหมด",
    "impressum": "การแสดงข้อมูลทางกฎหมาย",
    "datenschutz": "การปกป้องข้อมูล",
    "ueberuns": "เกี่ยวกับเรา"
  },

  "createRating": {
    "title": "เขียนรีวิว",
    "subtitle": "ให้คะแนน {{place}} ตามประสบการณ์ของคุณ",
    "barrierSuitable": "เหมาะสำหรับ {{barrierName}}",
    "commentLabel": "แบ่งปันประสบการณ์ของคุณ",
    "commentPlaceholder": "รายงานประสบการณ์",
    "whatToWrite": "ฉันควรเขียนอะไร?",
    "modalTitle": "คุณต้องการให้คะแนนอะไร?",
    "modalSubtitle": "ฉันต้องการประเมินการเข้าถึงสำหรับ:",
    "modalCancel": "ยกเลิก",
    "modalOk": "ตกลง",
    "addImagesTitle": "เพิ่มรูปภาพในรีวิวของคุณ!",
    "dropzoneText": "ลากรูปภาพมาที่นี่หรือคลิกเพื่อเลือกรูปภาพ",
    "submitButton": "ส่งรีวิว",
    "errorMessage": {
      "emptyComment": "ฟิลด์รายงานประสบการณ์ต้องไม่ว่างเปล่า",
      "maxFiles": "คุณสามารถอัปโหลดได้สูงสุด 5 รูปภาพ",
      "uploadError": "เกิดข้อผิดพลาดในการอัปโหลดไฟล์ โปรดลองอีกครั้ง"
    },
    "successMessage": "ขอบคุณ รีวิวของคุณถูกเพิ่มแล้ว!"
  },

  "barriers": {
    "barrier1": "ผู้ใช้รถเข็น",
    "barrier2": "เด็ก",
    "barrier3": "คนตาบอด",
    "barrier4": "คนหูหนวก",
    "barrier5": "ผู้ใช้ภาษาที่ไม่ใช่เจ้าของภาษาเยอรมัน",
    "barrier6": "ผู้ที่มีความวิตกกังวล",
    "barrier7": "ผู้ที่มีความบกพร่องทางสติปัญญา",
    "barrier8": "ผู้ที่มีความกลัวที่แคบ",
    "barrier9": "เจ้าของสุนัข"
  },

  "common": {
    "bewerten": "ให้คะแนน"
  },

  "usersection": {
    "profile_of": "โปรไฟล์ของ",
    "change_user_data": "เปลี่ยนแปลงข้อมูลผู้ใช้ของคุณและแก้ไขรีวิวของคุณที่ให้ไว้แล้ว",
    "your_ratings": "การให้คะแนนของคุณ",
    "you_rated": "คุณให้คะแนน",
    "read_more": "อ่านเพิ่มเติม"
  },

  "userProfileForm": {
    "personal_data": "ข้อมูลส่วนบุคคล",
    "first_name": "ชื่อจริง",
    "last_name": "นามสกุล",
    "email": "อีเมล",
    "save_changes": "บันทึกการเปลี่ยนแปลง",
    "update_success": "อัปเดตข้อมูลผู้ใช้สำเร็จแล้ว"
  },

  "map": {
    "where_to_travel": "คุณต้องการเดินทางไปที่ไหน?",
    "how_search_works": "..การค้นหาทำงานอย่างไร",
    "icon_map": "ไอคอนแผนที่",
    "how_search_works_title": "การค้นหาทำงานอย่างไร:",
    "step1": "เลือกเมืองจากรายการหรือค้นหาตรงที่อยู่เฉพาะโดยใช้ฟิลด์ค้นหาในแผนที่",
    "step2": "ป้อนประเภทของสถานที่ที่คุณต้องการเยี่ยมชม",
    "step3": "คลิกที่ไอคอนบนแผนที่เพื่อดูรีวิวสำหรับสถานที่นี้หรือเขียนรีวิว",
    "close": "ปิด"
  },

  "categorySelector": {
    "select_category": "เลือกหมวดหมู่"
  },
  "categories": {
    "category1": "ร้านอาหาร",
    "category2": "คลินิก",
    "category3": "โรงพยาบาล",
    "category4": "โรงเรียน",
    "category5": "พิพิธภัณฑ์",
    "category8": "โรงภาพยนตร์",
    "category9": "ร้านกาแฟ",
    "category10": "สถานที่ท่องเที่ยว"
  },

  "citySelector": {
    "select_city": "เลือกเมือง:"
  },

  "placeMarker": {
    "ratings": "การให้คะแนน",
    "create_rating": "ให้รีวิว"
  },

  "ratingspage": {
    "no_reviews": "ยังไม่มีรีวิวสำหรับสถานที่นี้ เขียนรีวิวและแบ่งปันประสบการณ์ของคุณ!",
    "add_review": "เพิ่มรีวิว",
    "back": "กลับ",
    "reviews": "รีวิว",
    "average_rating_for": "คะแนนเฉลี่ยสำหรับ",
    "review_by": "รีวิวโดย",
    "on": "เมื่อ",
    "read_more": "อ่านเพิ่มเติม"
  },

  "detailReview": {
    "review_of": "รีวิวของ",
    "on": "เมื่อ",
    "reviewed_by": "รีวิวของ {{userName}} สำหรับ {{placeName}}:",
    "suitable_for": "เหมาะสำหรับ",
    "icon_map": "ไอคอนแผนที่",
    "error_loading_reviews": "เกิดข้อผิดพลาดในการโหลดรีวิว",
    "back": "กลับ"
  },

  "reviewEdit": {
    "had": "มี",
    "on": "เมื่อ",
    "rated": "ให้คะแนน",
    "learn_more": "เรียนรู้เพิ่มเติมเกี่ยวกับรีวิวนี้",
    "suitable_for": "เหมาะสำหรับ",
    "icon_map": "ไอคอนแผนที่",
    "error_loading_reviews": "เกิดข้อผิดพลาดในการโหลดรีวิว",
    "update_success": "อัปเดตรีวิวสำเร็จแล้ว",
    "error_updating_review": "เกิดข้อผิดพลาดในการอัปเดตรีวิว",
    "delete_success": "ลบรีวิวสำเร็จแล้ว",
    "error_deleting_review": "เกิดข้อผิดพลาดในการลบรีวิว",
    "update": "อัปเดต",
    "delete": "ลบ",
    "back": "กลับ",
    "confirm_delete": "แน่ใจหรือไม่ว่าต้องการลบรีวิวนี้?",
    "cancel": "ยกเลิก",
    "comment_placeholder": "ป้อนคำอธิบายที่นี่"
  },

  "dataprotection": {
    "title": "การปกป้องข้อมูล",
    "section1": {
      "title": "1. การปกป้องข้อมูลในภาพรวม",
      "content": "เรายินดีที่คุณสนใจในเว็บไซต์ของเรา การปกป้องข้อมูลส่วนบุคคลของคุณมีความสำคัญอย่างยิ่งต่อเรา เราจะรักษาข้อมูลส่วนบุคคลของคุณอย่างเป็นความลับและปฏิบัติตามข้อกำหนดด้านกฎหมายการปกป้องข้อมูลและนโยบายการปกป้องข้อมูลนี้"
    },
    "section2": {
      "title": "2. หน่วยงานที่รับผิดชอบ",
      "content": "หน่วยงานที่รับผิดชอบการประมวลผลข้อมูลบนเว็บไซต์นี้คือ:"
    },
    "section3": {
      "title": "3. การเก็บรวบรวมและการเก็บข้อมูลส่วนบุคคล รวมถึงประเภทและวัตถุประสงค์ของการใช้งาน",
      "subtitle1": "a) เมื่อเยี่ยมชมเว็บไซต์",
      "content1": "เมื่อคุณเข้าถึงเว็บไซต์ของเรา ข้อมูลจะถูกส่งโดยอัตโนมัติไปยังเซิร์ฟเวอร์ของเว็บไซต์โดยเบราว์เซอร์ที่ใช้อุปกรณ์ของคุณ ข้อมูลนี้จะถูกจัดเก็บชั่วคราวในไฟล์บันทึก ข้อมูลดังต่อไปนี้จะถูกเก็บรวบรวมโดยไม่ต้องมีการแทรกแซงจากคุณและจะถูกเก็บไว้จนกว่าจะลบโดยอัตโนมัติ",
      "list1": [
        "ที่อยู่ IP ของคอมพิวเตอร์ที่ขอ,",
        "วันที่และเวลาในการเข้าถึง,",
        "ชื่อและ URL ของไฟล์ที่ดึง,",
        "เว็บไซต์ที่การเข้าถึงเกิดขึ้น (referrer URL),",
        "เบราว์เซอร์ที่ใช้และระบบปฏิบัติการของคอมพิวเตอร์ของคุณ และชื่อของผู้ให้บริการ"
      ],
      "content2": "ข้อมูลที่กล่าวถึงจะถูกประมวลผลโดยเราเพื่อวัตถุประสงค์ดังต่อไปนี้:",
      "list2": [
        "เพื่อให้มั่นใจในการเชื่อมต่อที่ราบรื่นกับเว็บไซต์,",
        "เพื่อให้มั่นใจถึงการใช้งานเว็บไซต์ที่สะดวกสบาย,",
        "การประเมินความปลอดภัยและเสถียรภาพของระบบ และ",
        "เพื่อวัตถุประสงค์ในการบริหารจัดการเพิ่มเติม"
      ],
      "content3": "ฐานทางกฎหมายในการประมวลผลข้อมูลคือ Art. 6 para. 1 p. 1 lit. f DSGVO ผลประโยชน์ที่ชอบด้วยกฎหมายของเราตามมาจากวัตถุประสงค์ในการเก็บข้อมูลที่ระบุข้างต้น เราจะไม่ใช้ข้อมูลที่เก็บรวบรวมเพื่อนำไปสู่ข้อสรุปเกี่ยวกับบุคคลของคุณ",
      "subtitle2": "b) การติดต่อ",
      "content4": "หากคุณติดต่อเราทางอีเมลหรือผ่านแบบฟอร์มติดต่อ ข้อมูลของคุณรวมถึงรายละเอียดการติดต่อที่คุณให้ไว้จะถูกเก็บไว้เพื่อวัตถุประสงค์ในการประมวลผลคำขอและคำถามต่อไป เราจะไม่แชร์ข้อมูลนี้โดยไม่ได้รับความยินยอมจากคุณ",
      "content5": "การประมวลผลข้อมูลที่ป้อนในแบบฟอร์มการติดต่อจึงเป็นไปตามความยินยอมของคุณเท่านั้น (Art. 6 para. 1 lit. a DSGVO) คุณสามารถเพิกถอนความยินยอมนี้ได้ทุกเมื่อ ข้อความทางอีเมลถึงเราถือว่าเพียงพอ ความถูกต้องตามกฎหมายของการประมวลผลข้อมูลที่ดำเนินการจนถึงการเพิกถอนจะไม่ถูกกระทบจากการเพิกถอน"
    },
    "section4": {
      "title": "4. การถ่ายโอนข้อมูล",
      "content": "ข้อมูลส่วนบุคคลของคุณจะไม่ถูกถ่ายโอนไปยังบุคคลที่สาม เว้นแต่คุณจะให้ความยินยอมอย่างชัดแจ้งหรือตามกฎหมายบังคับให้ต้องทำเช่นนั้น"
    },
    "section5": {
      "title": "5. สิทธิของบุคคลที่เกี่ยวข้อง",
      "content": "คุณมีสิทธิที่จะ:",
      "list": [
        "ขอข้อมูลเกี่ยวกับข้อมูลส่วนบุคคลของคุณที่เราประมวลผลตาม Art. 15 DSGVO,",
        "ขอแก้ไขข้อมูลส่วนบุคคลที่ไม่ถูกต้องหรือไม่สมบูรณ์ที่เราจัดเก็บตาม Art. 16 DSGVO,",
        "ขอการลบข้อมูลส่วนบุคคลของคุณที่เราจัดเก็บตาม Art. 17 DSGVO,",
        "ขอการจำกัดการประมวลผลข้อมูลส่วนบุคคลของคุณตาม Art. 18 DSGVO,",
        "รับข้อมูลส่วนบุคคลที่คุณให้ไว้กับเราที่มีโครงสร้าง เป็นที่ยอมรับ และอ่านได้โดยเครื่องตาม Art. 20 DSGVO,",
        "เพิกถอนความยินยอมที่เคยให้กับเราได้ทุกเมื่อตาม Art. 7 para. 3 DSGVO,",
        "ร้องเรียนไปยังหน่วยงานกำกับดูแลตาม Art. 77 DSGVO"
      ]
    },
    "section6": {
      "title": "6. สิทธิในการคัดค้าน",
      "content": "หากข้อมูลส่วนบุคคลของคุณถูกประมวลผลตามความสนใจที่ชอบด้วยกฎหมายตาม Art. 6 para. 1 p. 1 lit. f DSGVO คุณมีสิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคลของคุณตาม Art. 21 DSGVO"
    },
    "section7": {
      "title": "7. ความปลอดภัยของข้อมูล",
      "content": "เราจะใช้วิธีการ SSL (Secure Socket Layer) ร่วมกับการเข้ารหัสระดับสูงสุดที่เบราว์เซอร์ของคุณรองรับระหว่างการเยี่ยมชมเว็บไซต์"
    },
    "section8": {
      "title": "8. ความเป็นปัจจุบันและการเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้",
      "content": "นโยบายความเป็นส่วนตัวนี้เป็นปัจจุบันและมีสถานะ [วันที่] เนื่องจากการพัฒนาเพิ่มเติมของเว็บไซต์ของเราหรือเนื่องจากข้อกำหนดทางกฎหมายที่เปลี่ยนแปลง อาจจำเป็นต้องเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้"
    }
  },

  "loginpage": {
    "title": "เข้าสู่ระบบ",
    "subtitle": "กรุณาเข้าสู่ระบบเพื่อดำเนินการต่อ",
    "icon_alt": "ไอคอนเข้าสู่ระบบ",
    "email_placeholder": "ที่อยู่อีเมล",
    "password_placeholder": "รหัสผ่าน",
    "login_button": "เข้าสู่ระบบ",
    "forgot_password": "ลืมรหัสผ่าน?",
    "no_account": "ยังไม่มีบัญชีใช่ไหม?",
    "all_fields_required": "ต้องกรอกทุกช่อง",
    "password_reset_email_sent": "อีเมลสำหรับรีเซ็ตรหัสผ่านถูกส่งแล้ว กรุณาตรวจสอบกล่องจดหมายของคุณ",
    "reset_password_button": "รีเซ็ตรหัสผ่าน"
  },

  "forgotPasswordHandler": {
    "error_sending_email": "เกิดข้อผิดพลาดในการส่งอีเมลสำหรับรีเซ็ตรหัสผ่าน โปรดลองอีกครั้ง"
  },

  "registerpage": {
    "password_match_toast": "รหัสผ่านไม่ตรงกัน!",
    "password_length_toast": "รหัสผ่านต้องมีความยาวอย่างน้อย 8 อักขระ!",
    "register_success_toast": "ลงทะเบียนสำเร็จ! ยินดีต้อนรับ!",
    "register_error_toast": "เกิดข้อผิดพลาดในการลงทะเบียน โปรดลองอีกครั้งภายหลัง",
    "all_fields_required": "กรุณากรอกทุกช่องเพื่อทำการลงทะเบียน",
    "headline": "การลงทะเบียน",
    "description": "สร้างโปรไฟล์เพื่อส่งรีวิว",
    "emailPlaceholder": "ที่อยู่อีเมล",
    "firstNamePlaceholder": "ชื่อจริง",
    "lastNamePlaceholder": "นามสกุล",
    "passwordPlaceholder": "รหัสผ่าน",
    "confirmPasswordPlaceholder": "ยืนยันรหัสผ่าน",
    "submitButton": "ลงทะเบียน"
  },
  "FilterableSelect": {
    "select": "เลือก"
  }
}
